Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་མོས་མཐོང་ན། རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེས་འདིར་ནི་ལྷ་མཐུ་ཆེན་པོ་མཐུ་ཆེན་པོ། །རྫུ་འཕྲུལ་ཆེ་བ་དབང་ཆེ་བ། གཟི་བརྗིད་ཆེ་བདག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླག་པ་དང་། གཟུང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། གདུད་པ་བྱ་བ་དང་། རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པའི་ཕྱིར་ལྷགས་སོ། །ཞེས་བྱ་བར་ངེས་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་གལ་ཏེ་རིགས་ཀྱི་བུ་འམ།
en: II-III: 85} “if those noble sons or noble daughters behold great light around the place where this [book of] the perfection of wisdom has been placed, they should certainly understand that eminently powerful gods, endowed with great magical powers, great miraculous abilities, great authority, and great majesty will have arrived in order to recite, uphold, master, pay homage to, bow before, serve, respect, honor, and worship this perfection of wisdom. “

source: རིགས་ཀྱི་བུ་མོས་ལྷ་རྫས་ཀྱི་དྲི་མ་ལས་འདས་པ། སྔོན་ཆད་དེ་ལྟ་བུ་ཚོར་མ་རྨྱོང་བ་ཚོར་ན། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེས་འདི་ནི་ལྷ་མཐུ་ཆེན་པོ་མཐུ་ཆེན་པོ། རྫུ་འཕྲུལ་ཆེ་བ་དབང་ཆེ་བ་དང་། གཟི་བརྗིད་ཆེ་བདག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླག་པ་དང་། བཅང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། གདུད་པ་བྱ་བ་དང་། རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པའི་ཕྱིར་ལྷགས་སོ། །ཞེས་བྱ་བར་ངེས་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་གལ་ཏེ་རིགས་ཀྱི་བུ་འམ།
en: Moreover, Kauśika, if those noble sons or noble daughters smell a perfume surpassing that of the divine sacraments, which they have not previously scented, then they should certainly understand that eminently powerful gods, endowed with great magical powers, great miraculous abilities, great authority, and great majesty will have arrived in order to recite, uphold, master, pay homage to, bow before, serve, respect, honor, and worship this perfection of wisdom. “

source: རིགས་ཀྱི་བུ་མོ་གཙང་སྦྲའི་སྤྱོད་པ་དང་ལྡན་ན། དེའི་གཙང་སྦྲའི་སྤྱོད་པ་དེས། ལྷ་དེ་དག་ཀྱང་ཉེ་བར་འོངས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཀླག་པ་དང་། གཟུང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་།
en: Moreover, Kauśika, if those noble sons or noble daughters maintain scrupulous conduct, on account of their scrupulous conduct those gods will arrive there, and utterly rejoice after reciting, holding, mastering, serving, respecting, honoring, and worshiping this perfection of wisdom.

source: བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱས་ནས་ཤིན་དུ་དགའ་བའི་ཡིད་དུ་འགྱུར་རོ། །གནས་དེ་ན་ལྷ་མཐུ་ཆུང་ངུ་ཇི་སྙེད་ཅིག་གནས་པ་དེ་དག་ཀྱང་ལྷ་མཐུ་ཆེན་པོ་མཐུ་ཆེན་པོ་དེ་དག་གི་གཟི་བརྗིད་དང་། དཔལ་དང་། ཟིལ་མི་བཟོད་པའི་ཕྱིར་གནས་དེ་ནས་གུད་དུ་འདོང་བར་སེམས་སོ།
en: All gods of feeble power, as many as there are in that place, will be unable to bear the majesty, the glory, and the exaltedness of those eminently powerful gods, and so they will consider departing from that place.

source: །ཇི་ལྟ་ཇི་ལྟར་ལྷ་མཐུ་ཆེན་པོ་མཐུ་ཆེན་པོ། རྫུ་འཕྲུལ་ཆེ་བ་དང་། དབང་ཆེ་བ་དེ་དག་ཉེ་བར་འོང་བར་སེམས་པ། དེ་ལྟ་དེ་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ཡང་མོས་པ་རྒྱ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: The more those eminently powerful gods, endowed with great magical powers, great miraculous abilities, and great authority, think that they should come there, the more the resolve of those noble sons or noble daughters will be enhanced. “

source: །དེའི་གནས་ཀྱི་འཁོར་ཀུན་དུ་ཡང་གཙང་སྦྲ་མེད་པའི་སྤྱོད་པ་མི་རྒྱུ་བར་བྱས་ཏེ། རིགས་ཀྱི་བུའམ།
en: In proximity to the place where that [book is kept], they should not negligently engage in unscrupulous actions.

source: རིགས་ཀྱི་བུ་མོ་དེས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་དེའི་འཁོར་གྱིས་ཡང་སྤོས་ཆུའི་ཆག་ཆག་གིས་བཏབ་བོ། །མེ་ཏོག་དང་། སྤོས་ཀྱིས་གཏོར་རོ། །བདུག་སྤོས་འཐུལ་བའི་སྣོད་གཞག་གོ། །དར་གྱི་ལྡ་ལྡི་དང་། གོས་ཀྱི་བླ་རེ་བྲེ་ཞིང་སའི་ཕྱོགས་དེ་ཡང་རྣམ་པ་དུ་མས་བརྒྱན་པར་བྱའོ།
en: As an offering to this perfection of wisdom, those noble sons or noble daughters should also sprinkle the surrounding area with perfume, they should scatter flowers and incense, they should place containers of aromatic incense, they should hang silken flags, they should erect silken canopies, and thus should they adorn that area in many ways. “

source: །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་ལ་ངལ་ཞིང་ཆད་པར་འགྱུར་བ་མེད་དེ།
en: Kauśika, those noble sons or noble daughters will not tire and they will not be exhausted.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་ནི་ལུས་བདེ་བ་དང་། ལུས་ཡང་བ་དང་། ལུས་གསལ་བ་ཡང་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: Those noble sons or noble daughters will experience ease of body, lightness of body, and radiance of body.

source: །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེས་ནི་སེམས་བདེ་བ་དང་། སེམས་ཡང་བ་དང་། སེམས་གསལ་བ་ཡང་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: Those noble sons or noble daughters will also experience ease of mind, lightness of mind, and radiance of mind.

source: །དེ་ནས་ནུབ་མོ་ཉལ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བསམ་པས་མོས་པར་བྱས་ན། སྡིག་ཏོའི་རྨི་ལམ་མཐོང་བར་མི་འགྱུར་རོ། །དེས་མཐོང་ན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་མངའ་བ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ཀུན་དུ་བརྒྱན་པ། སྐུ་གསེར་གྱི་མདོག་ཏུ་བཞུགས་པ།
en: When they are asleep at night, they will maintain their resolve, intent on this perfection of wisdom, in consequence of which they will have no inauspicious dreams; for they will behold in their dreams the body of the tathāgata, arhat, completely awakened Buddha, excellently adorned with the thirty-two major marks of a great person, embellished with the eighty minor marks, and teaching the Dharma, his golden body surrounded by the community of monks and attended by a host of bodhisattvas. {

source: དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཀུན་ནས་བསྐོར་བ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་མདུན་དུ་བདར་བ། ཆོས་སྟོན་པ་མཐོང་བར་འགྱུར་ཏེ།
en: Ki.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལས་འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་ཆོས་བསྟན་པའང་ཐོས་པར་འགྱུར་རོ།
en: II-III: 86} They will also hear the Tathāgata impart the Dharma, comprising the six perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, and [all the fruitional attributes, up to and including] the eighteen distinct qualities of the buddhas.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་དེའི་དོན་རྣམ་པར་ཕྱེ་བ་ཡང་ཐོས་པར་འགྱུར་རོ།
en: They will hear the analysis of the meaning of these six perfections.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དེ་དག་གི་དོན་རྣམ་པར་ཕྱེ་བ་ཡང་ཐོས་པར་འགྱུར་རོ།
en: They will also hear the analysis of the meaning of all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, and [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: །བྱང་ཆུབ་ཀྱི་ཤིང་ཡང་མཐོང་བར་འགྱུར་རོ།
en: They will also behold the Tree of Enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་འགྲོ་བ་ཡང་མཐོང་བར་འགྱུར་རོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡང་མཐོང་བར་འགྱུར་རོ།
en: They will see the Bodhisattva Great Being approach the Tree of Enlightenment, and they will see him attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཡང་མཐོང་བར་འགྱུར་རོ།
en: They will see him, having attained consummate buddhahood, turning the wheel of the Dharma.

source: །བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་མང་པོ་ཆོས་ཡང་དག་པར་འགྲོ་བ་བྱེད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་འདི་ལྟར་ཡོངས་སུ་བསྒྲུབ་པར་བྱའོ། །སེམས་ཅན་མང་པོ་ནི་འདི་ལྟར་ཡོངས་སུ་སྨིན་པར་བྱའོ། །སངས་རྒྱས་ཀྱི་ཞིང་ནི་འདི་ལྟར་ཡོངས་སུ་བཟུང་བར་བྱའོ། །བདུད་འཁོར་དང་བཅས་པ་ནི་འདི་ལྟར་ཕམ་པར་བྱའོ་ཞེས་ཟེར་བ་དག་ཀྱང་མཐོང་བར་འགྱུར་རོ།
en: They will also behold many hundreds of thousands of bodhisattvas discussing the Dharma, saying how all-aspect omniscience should be attained, how many beings should be brought to maturity, how the buddhafields should be refined, and how māras, along with their entourages, should be defeated. “

source: །ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོའི་སྒྲ་ཡང་ཐོས་པར་འགྱུར་རོ། །ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་།
en: They will hear the voices of many hundred billion trillions of buddhas from the eastern direction.

source: ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོའི་སྒྲ་ཡང་ཐོས་པར་འགྱུར་ཏེ།
en: They will hear the voices of many hundred billion trillions of buddhas from the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as the nadir and the zenith.

source: འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་ན་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆེ་གེ་མོ་ཞིག་བཞུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་འདི་སྙེད་ཅིག་དང་། ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་འདི་སྙེད་ཅིག་གིས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ་ཆོས་སྟོན་ཏོ་ཞེས་བྱ་བའི་སྒྲ་ཐོས་པར་འགྱུར་རོ།
en: They will hear them saying, ‘In such and such a world system, the tathāgata, arhat, completely awakened Buddha So-and-so is present, teaching the Dharma, surrounded and attended by so many hundred billion trillions of bodhisattvas, and so many hundred billion trillions of śrāvakas.’ “

source: །ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དག་ཀྱང་མཐོང་བར་འགྱུར།
en: They will behold in the eastern direction many hundred billion trillions of buddhas who are passing into final nirvāṇa.

source: སྟེང་གི་ཕྱོགས་ཀྱི་བར་གྱི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དག་ཀྱང་མཐོང་བར་འགྱུར་ཏེ།
en: In the other directions, up to and including the zenith, they will behold many hundred billion trillions of buddhas who are also passing into final nirvāṇa.

source: མཆོད་རྟེན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ཡང་མཐོང་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དེ་དག་ཀྱང་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བདུག་སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། མཆོད་པ་སྣ་ཚོགས་མང་པོས་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་།
en: They will behold many billion trillions of stūpas, fashioned of the seven kinds of precious metals and gems, and they will behold themselves serving, respecting, honoring, and worshiping those stūpas of the tathāgatas, with flowers, garlands, incense, unguents, powders, religious robes, parasols, victory banners, ribbons, and other diverse offerings. “

source: བསྟི་སྟང་དུ་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་མཐོང་བར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་དེ་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་རྨི་ལམ་བཟང་པོ་དེ་ལྟ་བུ་དག་མཐོང་བར་འགྱུར་ཏེ། དེ་དག་བདེ་བར་ཉལ་ཞིང་བདེ་བར་ལྡང་བར་འགྱུར་རོ།
en: Kauśika, those noble sons or noble daughters will have auspicious dreams of this type, they will fall asleep easily, and they will awaken easily.

source: །དེའི་ལུས་ཀྱང་མདངས་དང་ལྡན་པར་འགྱུར་རོ།
en: They will have vitality of body.

source: །ལུས་ལ་ཡོང་བའི་ཉམས་ཡོད་པར་འགྱུར་ཞིང་། ལྕི་བའི་ཉམས་མེད་པར་འགྱུར།
en: They will experience lightness of body; they will lack the sensation of heaviness.

source: ཟས་ལ་ཆེར་ཆགས་པ་མེད་པར་འགྱུར། གོས་ལ་ཆགས་པ་མེད་པར་འགྱུར།
en: They will be without strong attachment to food, and they will be without strong attachment to clothing.

source: ནད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་ལ་ཆགས་པ་མེད་པར་འགྱུར།
en: They will be without strong attachment to medications used in the treatment of disease, and to everyday necessities.

source: ཟས་ཀྱི་འདུ་ཤེས་ཆུང་བར་འགྱུར། གོས་ཀྱི་འདུ་ཤེས་ཆུང་བར་འགྱུར།
en: They will have fewer ideas about food; they will have fewer ideas about clothing.

source: ནད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་ཀྱི་འདུ་ཤེས་ཀྱང་ཆུང་བར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་དཔེར་ན།
en: They will have fewer ideas about medications used in the treatment of disease, and about everyday necessities.

source: རྣལ་འབྱོར་ལ་སྤྱོད་པའི་དགེ་སློང་ཏིང་ངེ་འཛིན་ལས་ལངས་པའི་སེམས་ཡིད་ལ་བྱ་བས་ཡོངས་སུ་བརླན་པ་ནི། ཟས་ལ་ཆེར་ཆགས་པ་མེད་པ་ཡིན། ཟས་ཀྱི་འདུ་ཤེས་ཆུང་བ་ཡིན། ཀཽ་ཤི་ཀ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ཀྱང་ཟས་ལ་ཆེར་ཆགས་པ་མེད་པར་འགྱུར་རོ། །ཟས་ཀྱི་འདུ་ཤེས་ཆུང་བར་འགྱུར་རོ།
en: Kauśika, just as the mind of a monk who practices yoga, on arising from meditative stability, is drenched in attention, and is without strong attachment to food, and has fewer ideas about food, in the same way, Kauśika, those noble sons or noble daughters will also be without strong attachment to food and have fewer ideas about food.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལ་མི་མ་ཡིན་པ་རྣམས་ལུས་ལ་མདངས་ཉེ་བར་སྒྲུབ་བོ།། །ཤར་ཕྱོགས་དང་། ལྷོ་དང་། ནུབ་དང་།
en: If you ask why, Kauśika, nonhuman beings will sustain the vitality of their bodies. {

source: བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་།
en: Ki.

source: ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཇི་སྙེད་པ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: II-III: 87} However many lord buddhas there are, however many bodhisattvas there are, however many gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas there are in the eastern direction, and in the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as the nadir and the zenith, they will all sustain the vitality of their bodies. “

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཀྱང་དེའི་ལུས་ལ་མདངས་ཉེ་བར་སྒྲུབ་བོ། །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ཚེ་འདི་ཉིད་ལ་ཡོན་ཏན་འདི་དག་ཡོངས་སུ་བཟུང་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་ནན་ཏན་དུ་མཉན་པར་བྱའོ།
en: Kauśika, noble sons or noble daughters who wish to acquire these qualities in this very lifetime should earnestly listen to this very perfection of wisdom.

source: །གཟུང་བར་བྱའོ། །བཅང་བར་བྱའོ། །ཀླག་པར་བྱའོ། །ཀུན་ཆུབ་པར་བྱའོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱའོ།
en: They should take up, uphold, recite, master, and focus their attention correctly on it.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་ཡང་མི་འབྲལ་བར་བྱའོ། །ཀཽ་ཤི་ཀ་དེ་སྟེ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མ་བཟུང་མ་བཅངས། མ་བླགས། ཀུན་ཆུབ་པར་མ་བྱས།
en: They should never be separated from the mind set on all-aspect omniscience. “

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་མ་བྱས་ན་ཡང་། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་། གླེགས་བམ་དུ་བྱས་ཏེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱའོ། །བཀུར་སྟིར་བྱའོ། །བསྟི་སྟང་དུ་བྱའོ།
en: Kauśika, even if noble sons or noble daughters have not taken up, upheld, recited, mastered, or focused their attention correctly on it, they should commit this perfection of wisdom to writing and recite it, serving, respecting, honoring, and worshiping it with flowers, garlands, incense, unguents, powders, religious robes, parasols, victory banners, ribbons, and various musical sounds.

source: །མཆོད་པར་བྱའོ། །ཀཽ་ཤི་ཀ་དེ་ལྟར་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་དོན་དུ་ཞུགས་པ་ཡིན། ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཟུང་བ་དང་། བཅང་བ་དང་། ཀླག་པ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་བྲིས་ཏེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: In that manner, Kauśika, noble sons or noble daughters act for the benefit of many living beings and for the happiness of many living beings. “

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱེད། བཀུར་སྟིར་བྱེད། བསྟི་སྟང་དུ་བྱེད། མཆོད་པར་བྱེད་ན། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་གྱི། ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་བཞུགས་པ་རྣམས་ལ། ནམ་འཚོའི་བར་དུ་ན་བཟའ་དང་། བཤོས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་མང་པོས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་པ་དང་།
en: Kauśika, if noble sons or noble daughters take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and commit it to writing, and then serve, respect, honor, and worship it with flowers, garlands, incense, unguents, powders, religious robes, parasols, victory banners, ribbons, and various musical sounds, the merit of those noble sons or noble daughters will increase manifold.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་དག་མྱ་ངན་ལས་འདས་ནས་ཀྱང་། རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་མཆོད་རྟེན་བརྩིགས་ཏེ། ནམ་འཚོའི་བར་དུ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྦོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱས།
en: It will not be exceeded by those noble sons or noble daughters who for the duration of their lives have served, venerated, respected, and made offerings to the tathāgatas, arhats, completely awakened buddhas who are alive at present, along with their monastic communities of śrāvakas, in the world systems of all the ten directions, with food, bedding, medications for use in the treatment of disease, and many everyday necessities, or by those who, after those tathāgatas, arhats, completely awakened buddhas had passed into nirvāṇa along with their monastic communities of śrāvakas, have built stūpas made of the seven precious materials, and then served, venerated, respected, and made offerings to these stūpas for the duration of their life with flowers, garlands, perfumes, unguents, powders, religious robes, parasols, victory banners, ribbons, and various musical sounds.”

source: བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་པས་ནི་མ་ཡིན་ནོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་ཉི་ཤུ་གཅིག་པའོ།། །།
en: This completes the twenty-first chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་འཛམ་བུའི་གླིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་བྱུར་བུར་གང་བ་ཞིག་ཀྱང་རྙེད། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བྲིས་པ་ཞིག་ཀྱང་ལ་ལས་བྱིན་ན། དེ་ལས་གང་བླང་བར་བྱ།
en: Chapter 22 Then the Blessed One asked Śakra, mighty lord of the gods, “Kauśika, if you could possess Jambudvīpa, filled to the top with the bone relics of the tathāgatas, and if someone were to present you with this perfection of wisdom, written in the form of a book, which of these would you take?” “

source: བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་འཛམ་བུའི་གླིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་བྱུར་བུར་གཏམས་པ་ཞིག་ཀྱང་ལ་ལས་སྩལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བྲིས་པ་ཞིག་ཀྱང་ལ་ལས་སྩལ་ན།
en: Blessed Lord,” replied Śakra, “if someone were to present me with Jambudvīpa, filled to the top with the bone relics of the tathāgatas, and if someone were to present me with this perfection of wisdom, written in the form of a book, {Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་བདག་གིས་བླང་བར་བགྱིའོ།
en: II-III: 88} I would take this perfection of wisdom.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ལ་བདག་རིམ་གྲོ་མ་མཆིས་པ་ཡང་མ་ལགས། མི་སྟོན་པ་ཡང་མ་ལགས། བཙུན་པར་མི་བགྱིད་པ་ཡང་མ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་བདག་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་ལ་རིམ་གྲོ་བགྱི་བར་མི་འཚལ་བ་འམ།
en: If one were to ask why, Blessed Lord, it is not that I do not honor those bone relics of the tathāgatas, it is not that I do not display them, and it is not that I do not venerate them.

source: བཀུར་སྟིར་བགྱི་བར་མི་འཚལ་བའམ། བསྟི་སྟང་དུ་བགྱི་བར་མི་འཚལ་བ་འམ། མཆོད་པར་བགྱི་བར་མི་འཚལ་བ་ཡང་མ་ལགས་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་སྟེ།
en: Indeed, Blessed Lord, it is not that I do not serve the bone relics of the tathāgatas, it is not that I do not respect them, it is not that I do not venerate them, and it is not that I do not worship them, but, Blessed Lord, those bone relics of the tathāgatas have originated from the perfection of wisdom.

source: དེའི་སླད་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་ཀྱང་རིམ་གྲོར་བགྱི་བ་ལགས། བཀུར་སྟིར་བགྱི་བ་ལགས། བསྟི་སྟང་དུ་བགྱི་བ་ལགས། མཆོད་པར་བགྱི་བ་ལགས་སོ།
en: This is why the bone relics of the tathāgatas should be honored, this is why they should be respected, this is why they should be venerated, and this is why offerings should be made to them.

source: །སྐུ་གདུང་དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་བསྒྲུབས་པ་སྟེ།
en: Those bone relics have been formed by the perfection of wisdom.

source: དེའི་སླད་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ཀྱང་མཆོད་པ་མངའོ། །བཅོམ་ལྡན་འདས་ནམ་བདག་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་ལ་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: This is why those bone relics of the tathāgatas are indeed endowed with offerings.

source: ལྷ་རྫས་ཀྱི་སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བགྱིད་ཅིང་། བཀུར་སྟིར་བགྱིད་པ་དང་། བསྟི་སྟང་དུ་བགྱིད་པ་དང་མཆོད་པར་བགྱིད་པའི་ཚེ་ཡང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ལགས་པས་ན། ལྷ་དང་།
en: Blessed Lord, even though I serve, respect, honor, and worship the bone relics of the tathāgatas with divine flowers, garlands, incense, unguents, powders, robes, parasols, victory banners, ribbons, and various divine musical sounds, these bone relics of the tathāgatas have originated from the perfection of wisdom.

source: མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་རིམ་གྲོར་བགྱི་བ་ལགས། བཀུར་སྟིར་བགྱི་བ་ལགས། བསྟི་སྟང་དུ་བགྱི་བ་ལགས། མཆོད་པར་བགྱི་བ་ལགས་པས་བསྲུང་ཞིང་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པར་བགྱིད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤར་དྭ་ཏིའི་བུས།
en: For this reason they are honored, respected, and venerated, and offerings are made to them by this world with its gods, humans, and asuras, so that they are protected, honored, respected, venerated, and given offerings.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་གཟུང་དུ་མེད་པ་གཟུགས་མེད་པ། བལྟར་མེད་པ། ཐོགས་པ་མེད་པ། མཚན་ཉིད་གཅིག་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པ་ཡིན་ན།
en: Then the venerable Śāradvatīputra said to Śakra, mighty lord of the gods, “Kauśika, this perfection of wisdom cannot be grasped; it is formless, invisible, unimpeded, and has a single defining characteristic in that it is without defining characteristics.

source: དེ་ལ་ཁྱོད་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཟུང་དུ་མེད་པ། གཟུགས་མེད་པ། བལྟར་མེད་པ། ཐོགས་པ་མེད་པ་མཚན་ཉིད་གཅིག་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པ་ལ་གཟུང་བར་སེམས། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་།
en: In that case, how could you think of grasping the perfection of wisdom, which cannot be grasped and which is formless, invisible, unimpeded, and has a single defining characteristic in that it is without defining characteristics.

source: དོར་བར་བྱ་བའི་ཕྱིར་ཉེ་བར་གནས་པ་མ་ཡིན། འགྲིབ་པའི་ཕྱིར་མ་ཡིན། འཕེལ་བའི་ཕྱིར་མ་ཡིན། བསྐྱེད་པའི་ཕྱིར་མ་ཡིན། བསྐྱུང་བའི་ཕྱིར་མ་ཡིན། འབྲི་བའི་ཕྱིར་མ་ཡིན།
en: If you ask why, it is not established in order that it might be grasped or rejected, nor that it might be eclipsed, nor that it might be enhanced, nor that it might be developed, nor that it might be nurtured, nor that it might be supplemented, nor that it might be afflicted, nor that it might be purified.

source: བསྣན་པའི་ཕྱིར་མ་ཡིན། ཀུན་ནས་ཉོན་མོངས་པའི་ཕྱིར་མ་ཡིན། རྣམ་པར་བྱང་བའི་ཕྱིར་མ་ཡིན། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན། སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་འདོར་བ་མ་ཡིན།
en: It does not attain the attributes of the buddhas and it does not reject the attributes of ordinary persons.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་དང་། སློབ་པ་དང་། མི་སློབ་པའི་ཆོས་རྣམས་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན།
en: It does not attain the attributes of the bodhisattvas, the attributes of the pratyekabuddhas, the attributes of the śrāvakas, or the attributes of [the paths of] learning or of [the path of] no-more-learning.

source: སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་འདོར་བ་མ་ཡིན།
en: It does not reject the attributes of ordinary persons.
